In [5]:
import numpy as np
import pandas as pd
dataset = pd.read_csv("Data.csv")

In [6]:
dataset.shape

(10, 4)

In [7]:
dataset.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [8]:
dataset.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [9]:
(dataset==0).sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [10]:
dataset["Salary"]

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Salary, dtype: float64

In [11]:
sorted(dataset["Salary"])

[48000.0,
 52000.0,
 54000.0,
 58000.0,
 61000.0,
 72000.0,
 nan,
 67000.0,
 79000.0,
 83000.0]

In [12]:
dataset.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [13]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [17]:
if "Age" in dataset.columns:
    dataset["Age"] = dataset["Age"].astype(float)
    print("\nConverted 'Age' column to float.")

Converted 'Age' column to float.

In [18]:
print("\nUpdated data types of the dataset:")
print(dataset.dtypes)

Updated data types of the dataset:
Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [19]:
data_age = dataset['Age']
data_age.fillna(data_age.mode(), inplace=True)

data_age.isnull().sum()

np.int64(0)

In [20]:
data_sal = dataset['Salary']
data_sal.fillna(data_sal.mean(), inplace=True)

data_sal.isnull().sum()

np.int64(0)